
import 'package:cafegation/constants/colors.dart';
import 'package:cafegation/page/detail_page/detailMapModel.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'dart:async';
import 'dart:math';
import 'package:google_maps_flutter/google_maps_flutter.dart';


void main() {
  runApp(detailMapPage(xcoordinate: 0.0,ycoordinate: 0.0));
}

class detailMapPage extends StatelessWidget {
  const detailMapPage({Key? key,required this.xcoordinate, required this.ycoordinate}) : super(key: key);
  final double xcoordinate;
  final double ycoordinate;
  
  
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'Flutter Demo',
      theme: ThemeData(
        primarySwatch: Colors.blue,
      ),
      home: MapSample(xco:xcoordinate,yco: ycoordinate,),
    );
  }
}
class MapSample extends StatefulWidget {
  final double xco;
  final double yco;
  const MapSample({Key? key, required this.xco,required this.yco,}) : super(key: key);
  @override
  _MapSampleState createState() => _MapSampleState();
}

class _MapSampleState extends State<MapSample> {
  Set<Marker> _markers = {};
  late BitmapDescriptor mapMarker;
  @override
  void initState() {
    // TODO: implement initState
    super.initState();
    setCustomMarker();
  }

  void setCustomMarker() async {
    mapMarker = await BitmapDescriptor.fromAssetImage(ImageConfiguration(), 'assets/voramarker.png');
  }

  var cafe_position_dic = { 
    
    "소담상회 with 아이디어스 플레이스 서교": [
        37.5153154,
        126.8944329
    ],
    "피오니": [
        37.5500682,
        126.9197235
    ],
    "아오이토리": [
        37.5547393,
        126.9294391
    ],
    "망원동내커피 서교점": [
        37.5601779,
        126.8995393
    ],
    "작당모의": [
        37.5605541,
        126.9253866
    ],
    "버티컬커피": [
        0.0,
        0.0
    ],
    "라헬의부엌 홍대점": [
        37.5556067,
        126.9273159
    ],
    "푸하하크림빵": [
        37.5589347,
        126.9244013
    ],
    "공중도시": [
        0.0,
        0.0
    ],
    "카페 공명": [
        37.5598737,
        126.9262938
    ],
    "르쁘띠푸 홍대본점": [
        37.5498902,
        126.9232074
    ],
    "버터밀크": [
        37.55334,
        126.9279483
    ],
    "띵크프룻": [
        37.5549302,
        126.9292214
    ],
    "얀 쿠브레": [
        37.559279,
        126.9246171
    ],
    "943 킹스크로스CAFE": [
        0.0,
        0.0
    ],
    "트래블메이커": [
        0.0,
        0.0
    ],
    "모센즈스위트": [
        37.5497937,
        126.9208125
    ],
    "브런치가": [
        0.0,
        0.0
    ],
    "샌드커피 논탄토 연남": [
        37.5592558,
        126.9241105
    ],
    "마로스쿠키": [
        37.5482409,
        126.9188446
    ],
    "스탠스커피": [
        37.5487747,
        126.922426
    ],
    "팜플레무스": [
        0.0,
        0.0
    ],
    "커피리브레 연남점": [
        37.5623371,
        126.9266909
    ],
    "캘리포니아 도넛 클럽 & 비라티오 홍대점": [
        37.5511476,
        126.920215
    ],
    "자스아일랜드": [
        0.0,
        0.0
    ],
    "커피덕": [
        37.5567822,
        126.922669
    ],
    "콜린": [
        0.0,
        0.0
    ],
    "메이비 케이크 홍대본점": [
        0.0,
        0.0
    ],
    "산리오 러버스 클럽": [
        0.0,
        0.0
    ],
    "차차티클럽 연남": [
        37.5710399,
        127.011361
    ],
    "트래블카페 샬레": [
        37.5494435,
        126.9192097
    ],
    "모파상": [
        0.0,
        0.0
    ],
    "꾸울과자점": [
        37.5493619,
        126.9240817
    ],
    "상수동 카스티야": [
        37.5481306,
        126.9221506
    ],
    "달콤한거짓말": [
        37.5480288,
        126.920569
    ],
    "": [
        0.0,
        0.0
    ],
    "슈아브": [
        37.556704,
        126.9189023
    ],
    "카페식스": [
        0.0,
        0.0
    ],
    "비포블루밍": [
        37.5595622,
        126.9250374
    ],
    "아날로그가든": [
        37.5554268,
        126.9180104
    ],
    "키쉬미뇽": [
        37.5490727,
        126.9162059
    ],
    "페그로스터스": [
        0.0,
        0.0
    ],
    "알디프 티 바": [
        37.5558235,
        126.9293648
    ],
    "쥬마뺄": [
        37.556743,
        126.9287167
    ],
    "츄이구이브레드": [
        37.5545157,
        126.9170357
    ],
    "모크": [
        0.0,
        0.0
    ],
    "버터베이커리": [
        37.5599952,
        126.9240035
    ],
    "꽈페 홍대점": [
        37.5621786,
        126.9257118
    ],
    "커피폴리": [
        37.5520175,
        126.9159336
    ],
    "미남당 & 배배꼬": [
        0.0,
        0.0
    ],
    "언플러그드": [
        0.0,
        0.0
    ],
    "유니크디저트": [
        37.55518259999999,
        126.9302341
    ],
    "김진환 제과점": [
        37.5548153,
        126.93246
    ],
    "로우필름 카페앤갤러리": [
        37.5496538,
        126.9199332
    ],
    "랠리포인트": [
        37.5579444,
        126.9276672
    ],
    "크림온케이크": [
        37.5515814,
        126.9249751
    ],
    "카페 장쌤": [
        37.555689,
        126.9268598
    ],
    "코코샌드": [
        37.5597173,
        126.9252536
    ],
    "더페이머스램": [
        37.55639,
        126.9197166
    ],
    "파도": [
        0.0,
        0.0
    ],
    "히트커피로스터스 서교": [
        36.7735924,
        127.1363308
    ],
    "디스탕게": [
        0.0,
        0.0
    ],
    "투썸플레이스 홍대입구역점": [
        37.5574388,
        126.923412
    ],
    "Mon Cafe Gregory": [
        37.5482907,
        126.9187658
    ],
    "카페 지금여기": [
        37.5527109,
        126.9212076
    ],
    "밀로커피 로스터스": [
        37.5570351,
        126.9266137
    ],
    "루바브": [
        37.5573664,
        126.9255296
    ],
    "구르미산도 연남동 본점": [
        37.5602612,
        126.9254386
    ],
    "데일리라운드": [
        0.0,
        0.0
    ],
    "허밍벨라": [
        37.5503215,
        126.9199349
    ],
    "연남다방": [
        37.5604306,
        126.9257075
    ],
    "씨더라이트": [
        37.5566808,
        126.9254433
    ],
    "멜로우": [
        37.5518061,
        126.9199044
    ],
    "테일러커피 서교점": [
        37.5538615,
        126.927663
    ],
    "레이크커피바": [
        37.5542764,
        126.9179018
    ],
    "쿠앙플": [
        37.5541869,
        126.925891
    ],
    "튤립제과": [
        0.0,
        0.0
    ],
    "크리미무드": [
        37.5567724,
        126.9290795
    ],
    "쌔임쌔임": [
        0.0,
        0.0
    ],
    "신이도가": [
        37.55143,
        126.9209522
    ],
    "395빵집": [
        37.54963499999999,
        126.9165281
    ],
    "나와 나타샤": [
        0.0,
        0.0
    ],
    "폴리스팬케이크": [
        37.5615113,
        126.925452
    ],
    "요괴냥수비대": [
        37.5531711,
        126.9227931
    ],
    "로지네 케이크": [
        37.5660746,
        126.9282819
    ],
    "이뮤 베이크샵": [
        0.0,
        0.0
    ],
    "빌리엔젤 홍대점": [
        37.5533211,
        126.92498
    ],
    "Bread rum": [
        0.0,
        0.0
    ],
    "슬릿": [
        0.0,
        0.0
    ],
    "반지하커피": [
        37.5489532,
        126.921453
    ],
    "필로베이커리": [
        0.0,
        0.0
    ],
    "금옥당 서교점": [
        37.5487208,
        126.9202828
    ],
    "C27 홍대점": [
        37.5568946,
        126.9233
    ],
    "티거훗타임쿠키 in연남": [
        35.1486688,
        126.9228218
    ],
    "러빈허 플라워카페": [
        37.5563841,
        126.9297812
    ],
    "피크니크 홍대점": [
        0.0,
        0.0
    ],
    "카페 퍼프": [
        0.0,
        0.0
    ],
    "카페버킨": [
        37.5488759,
        126.9155739
    ],
    "소마드로잉카페 홍대점": [
        37.5541387,
        126.9167369
    ],
    "그릭데이 홍대점": [
        37.5536284,
        126.9238062
    ],
    "더브레드블루 신촌본점": [
        37.5551075,
        126.9327008
    ],
    "W카페": [
        37.5578764,
        126.921682
    ],
    "Blanc": [
        0.0,
        0.0
    ],
    "라뽀즈 비건케이크": [
        37.5485131,
        126.917374
    ],
    "차곡파티세리": [
        0.0,
        0.0
    ],
    "데코아발림본점": [
        37.5483293,
        126.9218047
    ],
    "이미커피": [
        37.557438,
        126.921896
    ],
    "샘쉿": [
        0.0,
        0.0
    ],
    "비하인드": [
        0.0,
        0.0
    ],
    "너프": [
        0.0,
        0.0
    ],
    "마가렛리버": [
        -33.9535468,
        115.0629667
    ],
    "어드밴스 커피": [
        0.0,
        0.0
    ],
    "멧라운지": [
        0.0,
        0.0
    ],
    "커피랩": [
        37.553733,
        126.922963
    ],
    "샌디비치 베이크하우스": [
        37.5567397,
        126.9152291
    ],
    "커피 벌스데이": [
        0.0,
        0.0
    ],
    "랑데자뷰 상수점": [
        37.5484158,
        126.9208247
    ],
    "오막": [
        0.0,
        0.0
    ],
    "데우스 카페": [
        37.5515814,
        126.9249751
    ],
    "오바도즈": [
        0.0,
        0.0
    ],
    "카페그랑주": [
        37.5541151,
        126.921545
    ],
    "폴링디저트": [
        37.5557044,
        126.9277559
    ],
    "79파운야드 합정점": [
        37.5483093,
        126.9185438
    ],
    "헤이트먼데이": [
        0.0,
        0.0
    ],
    "토라비": [
        37.5554671,
        126.9255433
    ],
    "리밀커피&밀리": [
        37.5545333,
        126.9186982
    ],
    "umoae": [
        0.0,
        0.0
    ],
    "한땀": [
        0.0,
        0.0
    ],
    "A SLICE": [
        0.0,
        0.0
    ],
    "크리스가든": [
        37.5493383,
        126.9212981
    ],
    "긱스그릭": [
        0.0,
        0.0
    ],
    "리버웨이": [
        0.0,
        0.0
    ],
    "라프하우스": [
        37.5272929,
        126.906632
    ],
    "스퀘어이미": [
        37.5588315,
        126.9242477
    ],
    "모멘트커피 2호점": [
        37.5576362,
        126.9210313
    ],
    "치키차카초코 서교본점": [
        0.0,
        0.0
    ],
    "톤앤매너": [
        37.554225,
        126.9286678
    ],
    "자유인들": [
        37.5509833,
        126.9241409
    ],
    "언더플로어": [
        0.0,
        0.0
    ],
    "당분간 제과점": [
        37.5593758,
        126.924361
    ],
    "와플칸 연남점": [
        37.5525227,
        126.9237865
    ],
    "공차 홍대서교점": [
        37.5546031,
        126.9305106
    ],
    "아레아레아": [
        37.5593017,
        126.9257145
    ],
    "공룡빵공장": [
        37.5578505,
        126.9284371
    ],
    "갤러리카페 바이아스": [
        37.5563985,
        126.9278931
    ],
    "레드플랜트": [
        37.5511874,
        126.915322
    ],
    "스노브 홍대점": [
        37.5497599,
        126.922864
    ],
    "퐁포네뜨": [
        37.5538415,
        126.9258752
    ],
    "헤이쥬드": [
        0.0,
        0.0
    ],
    "로펠로세라": [
        0.0,
        0.0
    ],
    "춘삼": [
        0.0,
        0.0
    ],
    "릴리우드": [
        37.5537101,
        126.9326018
    ],
    "오흐뒤구떼": [
        0.0,
        0.0
    ],
    "코코아트리": [
        37.5484306,
        126.9222493
    ],
    "빵나무": [
        37.5575972,
        126.9213759
    ],
    "서교동언니네": [
        37.55361389999999,
        126.9234658
    ],
    "해피베어데이 상수점": [
        37.5516415,
        126.9181594
    ],
    "앤디스커피 홍대점": [
        37.5563616,
        126.9267087
    ],
    "스타일난다 핑크풀카페": [
        37.5545066,
        126.9274245
    ],
    "루나틱커피": [
        37.5559436,
        126.9302956
    ],
    "미카야": [
        37.5554456,
        126.918184
    ],
    "브라운시티 본점": [
        37.5522109,
        126.9238073
    ],
    "코코시에나 티오마카세": [
        37.5618039,
        126.9255616
    ],
    "엔제리너스 L7홍대점": [
        37.5572572,
        126.9248916
    ],
    "잉큼케이크": [
        37.56181280000001,
        126.9261064
    ],
    "르바자르 카페&바": [
        37.5553933,
        126.9289261
    ],
    "머씨커피": [
        0.0,
        0.0
    ],
    "포비브라이트 홍대": [
        37.5697569,
        126.973165
    ],
    "카페 바우": [
        37.5553038,
        126.9274968
    ],
    "펠앤콜": [
        37.5481291,
        126.9221548
    ],
    "언제라도 여행": [
        0.0,
        0.0
    ],
    "카페공휴": [
        37.5485099,
        126.9232268
    ],
    "단하나케이크 홍대점": [
        0.0,
        0.0
    ],
    "카페333": [
        37.5552541,
        126.926995
    ],
    "머드거트 신촌": [
        37.5594793,
        126.9435838
    ],
    "북카페 산책": [
        37.5515814,
        126.9249751
    ],
    "카페 이스트": [
        37.552314,
        126.9156475
    ],
    "로덴드론 동교점": [
        37.5701024,
        126.9322352
    ],
    "카페 플랫": [
        37.5375467,
        126.9885156
    ],
    "할리스 홍대입구역점": [
        0.0,
        0.0
    ],
    "민트하임": [
        0.0,
        0.0
    ],
    "밀가루인쇄소": [
        37.54838220000001,
        126.9247397
    ],
    "젤라떼리아 에따": [
        37.5580315,
        126.9217906
    ],
    "커스텀커피 합정점": [
        37.5532358,
        126.9143779
    ],
    "홍대버튼": [
        0.0,
        0.0
    ],
    "핸드릭스커피로스터스": [
        37.5571214,
        126.9209946
    ],
    "낙랑파라": [
        37.5599406,
        126.9253274
    ],
    "시루모락": [
        37.5506584,
        126.9174679
    ],
    "크레미뇽": [
        37.5588732,
        126.924572
    ],
    "너드플래닛": [
        0.0,
        0.0
    ],
    "카페 꼬모": [
        37.55186870000001,
        126.9218195
    ],
    "설빙 홍대입구역점": [
        37.55531939999999,
        126.9226786
    ],
    "공미학 마포홍대점": [
        37.55635120000001,
        126.923885
    ],
    "코칭심리카페": [
        0.0,
        0.0
    ],
    "글로어": [
        37.5505485,
        126.9214085
    ],
    "베니케이크": [
        37.5548316,
        126.9276983
    ],
    "군드립커피숍": [
        37.5523393,
        126.9167279
    ],
    "칼디커피": [
        37.5558662,
        126.9272232
    ],
    "블랙피라미드": [
        37.5545683,
        126.9266812
    ],
    "팀플레이스": [
        37.5568691,
        126.9206567
    ],
    "파우스 디멘션": [
        37.5514321,
        126.9184815
    ],
    "와플대학 홍대캠퍼스": [
        37.5572099,
        126.9249716
    ],
    "아지트리": [
        0.0,
        0.0
    ],
    "카페나린1.5": [
        0.0,
        0.0
    ],
    "인더스트커피": [
        0.0,
        0.0
    ],
    "카페픽": [
        37.5489685,
        126.9211551
    ],
    "코코버블티 홍대점": [
        0.0,
        0.0
    ],
    "키펜지카페": [
        36.81688159999999,
        127.1535544
    ],
    "타르틴 베이커리 서교 RYSE호텔점": [
        37.5543688,
        126.9213026
    ],
    "카페 안온": [
        37.5536609,
        126.9381662
    ],
    "로스팅마스터즈 본점": [
        37.5551755,
        126.9165469
    ],
    "블룸스토리": [
        37.561858,
        126.9265338
    ],
    "북카페 피터캣": [
        37.5580229,
        126.9292699
    ],
    "심리상담카페 어웨이크닝": [
        0.0,
        0.0
    ],
    "애프터눈커피": [
        37.556599,
        126.9289935
    ],
    "타이거슈가 홍대본점": [
        37.5554718,
        126.9239791
    ],
    "아메노히 커피점": [
        37.5556843,
        126.9310067
    ],
    "리틀빅토리": [
        37.56074479999999,
        126.9256814
    ],
    "딥커피": [
        37.5584961,
        126.9233175
    ],
    "카페어스": [
        37.5485415,
        126.9193959
    ],
    "피스오브헤븐": [
        37.5479333,
        126.9214688
    ],
    "카페로제": [
        37.5556721,
        126.9281752
    ],
    "스웨이드": [
        0.0,
        0.0
    ],
    "더페이머스램베이커리": [
        37.55639,
        126.9197166
    ],
    "메가커피 홍대입구역점": [
        37.5561596,
        126.9242126
    ],
    "마이보스턴": [
        37.5549293,
        126.9311114
    ],
    "카페 틈이 있는 곳": [
        37.5481509,
        126.9218086
    ],
    "그로브177": [
        37.5567089,
        126.9292135
    ],
    "호호미욜": [
        37.5487998,
        126.9232059
    ],
    "턴테이블커피바": [
        0.0,
        0.0
    ],
    "도토리앤다람쥐": [
        37.5538035,
        126.9293812
    ],
    "쇼콜라윰": [
        37.5524136,
        126.9225506
    ],
    "터틀힙": [
        37.5567684,
        126.9257668
    ],
    "랑데자뷰": [
        37.5541195,
        126.9270724
    ],
    "컨택트": [
        0.0,
        0.0
    ],
    "1984": [
        37.5573343,
        126.9228434
    ],
    "모리츠플라츠": [
        37.5560234,
        126.9313369
    ],
    "로파이": [
        37.5497699,
        126.9222489
    ],
    "해피베어데이": [
        37.5516415,
        126.9181594
    ],
    "EGO": [
        0.0,
        0.0
    ],
    "공상온도": [
        37.5575945,
        126.9197307
    ],
    "카페요호": [
        37.5551889,
        126.9158129
    ],



};
  

  void _onMapCreated(GoogleMapController controller) {
    setState(() {
      _markers.add(
        Marker(
          markerId: MarkerId('ID-1'), 
          position: LatLng(37.55161117059624, 126.92496705369715),
          icon: mapMarker,
          infoWindow: InfoWindow(
            title: 'Hongik University',
            snippet: 'GOOD',
          ),
        ),
      );
      cafe_position_dic.forEach((key, List value) {
        _markers.add(
        Marker(
          markerId: MarkerId('$key'), 
          position: LatLng(value[0], value[1]),
          icon: mapMarker,
          infoWindow: InfoWindow(
            title: '$key',
            snippet: 'GOOD',
            ),
          ),
       );
        
      });

    }
    );

  }
  
  @override
  Widget build(BuildContext context){
    return Scaffold(
      appBar: AppBar(
        title: Text("Find Your Cafe"),
      ),
      body: GoogleMap(
        onMapCreated: _onMapCreated,
        markers: _markers,
        initialCameraPosition: CameraPosition(
          target: LatLng(widget.xco, widget.yco),
          zoom: 18)
        )
    );
  }
}

